[Rainmeter]
Update=1000
AccurateText=0
DynamicWindowSize=0
Group=ToggleByAssistBtn

[Metadata]
Name=Rhodes_Island_UI
Author=热心炎国云玩家
Information=让您在PC上也能享受到罗德岛终端系统的交互界面。|作战终端，如果你的作战内容是欣赏音乐的话。
License=Closure Commons 署名-不许获利-传递下去 42.0
Version=0.9.0

[Variables]
@Include1=#@#GlobalVars.inc
@Include2=#@#Includes\mMusic.inc
@Include3=#@#Includes\Terminal.inc


;"啊，想听点音乐。"
[Terminal]
LeftMouseUpAction=#RelsAct##MusicTerminalAction#

[TerminalDots]

[TerminalIconDrop]
ImageName=#MusicTerminalIcon#
Hidden=#MusicTerminalHideIconBackdrop#

[Terminal_BL]

[TerminalIcon]
ImageName=#MusicTerminalIcon#

[TerminalTitle]
Text=#MusicTerminalTitle#

;当前状态
[TerminalStateBg]
ToolTipIcon=Info
ToolTipTitle=#MusicTerminalStateTooltipTitle#
ToolTipText=#MusicTerminalStateTooltip#
ToolTipWidth=300
LeftMouseUpAction=[!CommandMeasure m#NPType#Player "PlayPause"][!UpdateMeasureGroup #NPType#Player][!UpdateMeter TerminalState][!Redraw]
MouseScrollUpAction=[!CommandMeasure m#NPType#Player "Previous"][!UpdateMeasureGroup #NPType#Player]
MouseScrollDownAction=[!CommandMeasure m#NPType#Player "Next"][!UpdateMeasureGroup #NPType#Player]
LeftMouseDownAction=[Play #BtnSound#]

[TerminalState]
MeasureName=m#NPType#PlayerState

[TerminalNow]
MeasureName=m#NPType#Player


;理智指示器
;失去理智.png
[TerminalSanBg]
ToolTipIcon=Info
ToolTipTitle=#MusicTerminalSanTooltipTitle#
ToolTipText=#MusicTerminalSanTooltip#
MouseScrollUpAction=[!CommandMeasure m#NPType#Player "SetPosition +5"][!UpdateMeasureGroup #NPType#Player][!UpdateMeter TerminalSan][!Redraw]
MouseScrollDownAction=[!CommandMeasure m#NPType#Player "SetPosition -5"][!UpdateMeasureGroup #NPType#Player][!UpdateMeter TerminalSan][!Redraw]

[TerminalSanMax]

[TerminalSanLabel]
Text=#MusicTerminalSanLabel#

[TerminalSanIcon]

[TerminalSanAddBg]

[TerminalSanAddIcon]

[TerminalSan]
MeasureName=m#NPType#PlayerProg


;导入频谱可视化 ;"哈几马路油!"
;根据以下文件的设置，更新间隔将改为60ms。
@Include4=#@#Includes\VisWave.inc


;显示，封面横幅。
[TerminalCover]
Meter=Image
MeasureName=m#NPType#PlayerArt
SolidColor=#PrimaryFGColor#
Padding=0,0,160,0
X=540
Y=([Terminal:H]*0.08)
H=([Terminal:H]*0.84)
DynamicVariables=1
Container=TerminalMask
LeftMouseDownAction=[Play #BtnSound#]
;试着改为被动刷新降低大图像带来的CPU负担，但是，没有效果。
;UpdateDivider=-1

;他戴上了遮罩。
[TerminalMask]


;装饰线
[TerminalDecoLine]